In [1]:
import pandas as pd
import numpy as np

data = {'state': ['ohio', 'ohio', 'nevada', 'nevada'],
        'year': [2000, 2001, 2002, 2001],
        'pop': [1.7, 2.4, 3.6, 2.9]}
df = pd.DataFrame(data, columns=['year', 'pop', 'state'],
                     index=['one', 'two', 'three', 'four'])
df

       year  pop   state
one    2000  1.7    ohio
two    2001  2.4    ohio
three  2002  3.6  nevada
four   2001  2.9  nevada

# 1、单纯取行或列

In [2]:
df['year']

one      2000
two      2001
three    2002
four     2001
Name: year, dtype: int64

df[列名]  返回Series, 等价于 df.列名

In [3]:
df.year

one      2000
two      2001
three    2002
four     2001
Name: year, dtype: int64

In [4]:
df[['year']]

       year
one    2000
two    2001
three  2002
four   2001

df[[列名]],返回DataFrame，

In [5]:
df[1:3]

       year  pop   state
two    2001  2.4    ohio
three  2002  3.6  nevada

选择行，

#  2、loc  行或列只能是标签名。 只加一个参数时，只能进行 行 选择

In [10]:
df.loc[['one', 'three'], 'pop']

one      1.7
three    3.6
Name: pop, dtype: float64

In [11]:
df.loc[:, 'state']

one        ohio
two        ohio
three    nevada
four     nevada
Name: state, dtype: object

In [12]:
df.loc['one']

year     2000
pop       1.7
state    ohio
Name: one, dtype: object

In [13]:
df.loc[['one', 'three']]

       year  pop   state
one    2000  1.7    ohio
three  2002  3.6  nevada

# 3、at，与loc用法一致，只能访问单个元素， 比loc访问速度更快

In [14]:
df.at['one', 'pop']

1.7

# 4、iloc， 和loc的区别在于，是根据行/列的位置来选取，

In [15]:
df.iloc[2]

year       2002
pop         3.6
state    nevada
Name: three, dtype: object

In [16]:
df.iloc[2:4]

       year  pop   state
three  2002  3.6  nevada
four   2001  2.9  nevada

In [17]:
df.iloc[2:4, 1]

three    3.6
four     2.9
Name: pop, dtype: float64

In [18]:
df.iloc[:, :2]

       year  pop
one    2000  1.7
two    2001  2.4
three  2002  3.6
four   2001  2.9

#  4、iat，与at用法一致， 两者的关系等同于 iloc / loc关系，只能基于位置上的单个取值

In [19]:
df.iat[2, 2]

'nevada'